SteveLRojas/mcu_libs/CH559/CH559_RA6963/CH559_RA6963.h
#ifndef _CH559_RA6963_H_
#define _CH559_RA6963_H_

//HINT: Pin options. Use defines from GPIO library.
#define RA6963_PORT_SD	GPIO_PORT_2
#define RA6963_PORT_WR	GPIO_PORT_4
#define RA6963_PORT_RD	GPIO_PORT_4
#define RA6963_PORT_CE	GPIO_PORT_4
#define RA6963_PORT_CD	GPIO_PORT_4
#define RA6963_PIN_WR	GPIO_PIN_3
#define RA6963_PIN_RD	GPIO_PIN_2
#define RA6963_PIN_CE	GPIO_PIN_1
#define RA6963_PIN_CD	GPIO_PIN_0

//HINT: If your module has a font selection pin be sure to set it for 8x8 font size.
#define RA6963_NUM_COLUMNS	128
#define RA6963_NUM_ROWS		64
#define RA6963_ROW_SIZE		((RA6963_NUM_COLUMNS + 7) / 8)
#define RA6963_BUF_SIZE		RA6963_ROW_SIZE * RA6963_NUM_ROWS

#define RA6963_COM_SET_CURSOR_POINTER		0x21
#define RA6963_COM_SET_OFFSET_REGISTER		0x22
#define RA6963_COM_SET_ADDRESS_POINTER		0x24
#define RA6963_COM_SET_TEXT_HOME_ADDR		0x40
#define RA6963_COM_SET_TEXT_AREA			0x41
#define RA6963_COM_SET_GRAPHIC_HOME_ADDR	0x42
#define RA6963_COM_SET_GRAPHIC_AREA			0x43
#define RA6963_COM_SET_MODE					0x80
#define RA6963_COM_SET_DISPLAY_MODE			0x90
#define RA6963_COM_CURSOR_1_LINE			0xA0
#define RA6963_COM_CURSOR_2_LINE			0xA1
#define RA6963_COM_CURSOR_3_LINE			0xA2
#define RA6963_COM_CURSOR_4_LINE			0xA3
#define RA6963_COM_CURSOR_5_LINE			0xA4
#define RA6963_COM_CURSOR_6_LINE			0xA5
#define RA6963_COM_CURSOR_7_LINE			0xA6
#define RA6963_COM_CURSOR_8_LINE			0xA7
#define RA6963_COM_DATA_AUTO_WRITE			0xB0
#define RA6963_COM_DATA_AUTO_READ			0xB1
#define RA6963_COM_AUTO_RESET				0xB2
#define RA6963_COM_DATA_READ_WRITE			0xC0
#define RA6963_COM_SCREEN_REVERSE			0xD0
#define RA6963_COM_SCREEN_PEEK				0xE0
#define RA6963_COM_SCREEN_COPY				0xE8
#define RA6963_COM_BLINK_TIME				0x50
#define RA6963_COM_CURSOR_AUTO_MOVE			0x60
#define RA6963_COM_CGROM_FONT_SELECT		0x70

#define RA6963_MODE_OR			0x00
#define RA6963_MODE_XOR			0x01
#define RA6963_MODE_AND			0x03
#define RA6963_MODE_TEXT_ATTR	0x04
#define RA6963_MODE_INTERNAL	0x00
#define RA6963_MODE_EXTERNAL	0x08

#define RA6963_DISPLAY_MODE_OFF			0x00
#define RA6963_DISPLAY_MODE_CURS_ON		0x02
#define RA6963_DISPLAY_MODE_BLINK_ON	0x01
#define RA6963_DISPLAY_MODE_TEXT_ON		0x04
#define RA6963_DISPLAY_MODE_GRAPHIC_ON	0x08

#define RA6963_DATA_READ_WRITE_WRITE	0x00
#define RA6963_DATA_READ_WRITE_READ		0x01
#define RA6963_DATA_READ_WRITE_INC_ADP	0x00
#define RA6963_DATA_READ_WRITE_DEC_ADP	0x02
#define RA6963_DATA_READ_WRITE_HOLD_ADP	0x04

extern UINT8 ra6963_status_mask;
extern UINT8 ra6963_frame_buf[RA6963_BUF_SIZE];

#define ra6963_update_display() ra6963_update_rows(0, RA6963_NUM_ROWS)

void ra6963_init(void);
void ra6963_send_command(UINT8 command);
void ra6963_send_data(UINT8 val);
void ra6963_set_pixel(UINT8 row, UINT8 col, UINT8 state);
void ra6963_draw_text(UINT8 row, UINT8 text_col, char* str);
void ra6963_scroll_up(UINT8 num_rows);
void ra6963_clear_display(UINT8 fill);
void ra6963_clear_rows(UINT8 start, UINT8 end, UINT8 fill);
void ra6963_update_rows(UINT8 start, UINT8 end);

#endif
